{
  "architectures": [
    "SigmaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_sigma.SigmaConfig",
    "AutoModel": "modeling_sigma.SigmaModel",
    "AutoModelForCausalLM": "modeling_sigma.SigmaForCausalLM",
    "AutoTokenizer": "tokenization_sigma.SigmaTokenizer"
  },
  "aux_loss_alpha": 0.0001,
  "bos_token_id": 199999,
  "eos_token_id": 199999,
  "ep_size": 1,
  "first_k_dense_replace": 2,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.006,
  "intermediate_size": 7168,
  "kv_lora_rank": 512,
  "max_position_embeddings": 4096,
  "model_type": "sigma",
  "moe_intermediate_size": 1536,
  "n_routed_experts": 64,
  "n_shared_experts": 3,
  "norm_topk_prob": true,
  "num_attention_heads": 16,
  "mha_num_attention_heads": 16,
  "num_experts_per_tok": 6,
  "num_hidden_layers": 28,
  "num_key_value_heads": 16,
  "q_lora_rank": null,
  "qk_nope_head_dim": 96,
  "qk_rope_head_dim": 32,
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "beta_fast": 32,
    "beta_slow": 1,
    "factor": 40,
    "mscale": 0.707,
    "mscale_all_dim": 0.707,
    "original_max_position_embeddings": 4096,
    "type": "yarn"
  },
  "rope_theta": 10000,
  "routed_scaling_factor": 1.0,
  "scoring_func": "sigmoid",
  "seq_aux": true,
  "tie_word_embeddings": false,
  "topk_method": "noaux_tc",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.33.1",
  "use_cache": true,
  "v_head_dim": 128,
  "vocab_size": 200064,
  "sliding_window": 4096,
  "_attn_implementation": "flash_attention_2"
}
